programming/course/understanding_typescript.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Understanding TypeScript

* Get Started
** Install TypeScript

#+BEGIN_SRC sh
npm install -g typescript
#+END_SRC

** Use TypeScript

Create a simple TypeScript script:

#+CAPTION: =script.ts=
#+BEGIN_SRC typescript
class Greeter {
  greeting: string;
  constructor(message: string) {
    this.greeting = message;
  }
  greet() {
    return "Hello, " + this.greeting;
  }
}

let greeter = new Greeter("world");

let button = document.createElement("button");
button.textContent = "Say Hello";
button.onclick = function() {
  alert(greeter.greet());
};

document.body.appendChild(button);
#+END_SRC

Compile it to JavaScript:

#+BEGIN_SRC sh
tsc script.ts
# Generates script.js
#+END_SRC

Embed the JavaScript file to an HTML document and see the effect.

** Set Up the Course Workspace

- [[https://www.npmjs.com/package/lite-server][npm | lite-server]]

lite-server is a local dev server which loads latest files automatically. Install lite-server:

#+BEGIN_SRC sh
npm init
npm install --save-dev lite-server
#+END_SRC

Add an npm command to start lite-server:

#+CAPTION: =package.json=
#+BEGIN_SRC js
{
  "scripts": {
    "start": "lite-server"
  }
}
#+END_SRC

Create a simple =index.html= and start lite-server, which will open [[http://localhost:3000/]] in browser.

-----

Initialize the directory as TypeScript project: 

#+BEGIN_SRC sh
tsc --init
# Generates tsconfig.json
#+END_SRC

Then command =tsc= will compile all TypeScript files in the directory, file names are not needed anymore.

** Understand the Created JavaScript Code

Once TypeScript is compiled into JavaScript, all the type notations are removed, the result code doesn't have type constraints. TypeScript only prevents type errors during the compiling process.

* Using Types For A Better Code
** Module Exercise

Add types as explicitly as possible to this code:

#+BEGIN_SRC typescript
let bankAccount = {
    money: 2000,
    deposit(value) {
        this.money += value;
    }
};
 
let myself = {
    name: "Max",
    bankAccount: bankAccount,
    hobbies: ["Sports", "Cooking"]
};
 
myself.bankAccount.deposit(3000);
#+END_SRC

Result:

#+BEGIN_SRC typescript
type BankAccount = {
    money: number,
    deposit: (value: number) => void
};

type User = {
    name: string,
    bankAccount: BankAccount,
    hobbies: string[]
};

let account: BankAccount = {
    money: 2000,
    deposit(value: number): void {
        this.money += value;
    }
};
 
let me: User = {
    name: "Max",
    bankAccount: account,
    hobbies: ["Sports", "Cooking"]
};
 
me.bankAccount.deposit(3000);
#+END_SRC

* TypeScript and ES6
** The Spread and Rest Operators

- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax][MDN | JavaScript | Reference | Expressions & Operators | Spread Syntax]]
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/rest_parameters][MDN | JavaScript | Reference | Functions | Rest Parameters]]

#+BEGIN_SRC typescript
const foo = (...args: string[]) => { // Rest
  console.log(args);
}
let bar: string[] = ["b", "a", "r"];
foo(...bar); // Spread
#+END_SRC

* Namespaces and Modules
** Namespaces and Multiple Files

When a namespace spreads across multiple files:

- Compile the files individually and include all the =.js= files in HTML.
- Compile the files into a single file by =tsc --outFile app.js foo.ts bar.ts ...=.
- Use =/// <reference/>= notation to declare the dependencies among the files, and compile the entry file. Compiler will automatically include the referenced files.

** Limitations of Namespaces

When the application grow, dependencies become less maintainable by using namespaces which needs the =/// <reference/>= notation. Modules should be used in this scenario. 

