programming/course/understanding_typescript.html
---
title: "Understanding TypeScript"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-14 Mon 16:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding TypeScript</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Understanding TypeScript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcfc0106">1 Get Started</a>
<ul>
<li><a href="#org95de0d9">1.1 Install TypeScript</a></li>
<li><a href="#org451040b">1.2 Use TypeScript</a></li>
<li><a href="#org72fdad9">1.3 Set Up the Course Workspace</a></li>
<li><a href="#orgba22866">1.4 Understand the Created JavaScript Code</a></li>
</ul>
</li>
<li><a href="#orgfb66ae3">2 Using Types For A Better Code</a>
<ul>
<li><a href="#org2231019">2.1 Module Exercise</a></li>
</ul>
</li>
<li><a href="#org9424572">3 TypeScript and ES6</a>
<ul>
<li><a href="#org75da616">3.1 The Spread and Rest Operators</a></li>
</ul>
</li>
<li><a href="#orgc85f9b4">4 Namespaces and Modules</a>
<ul>
<li><a href="#org46c525f">4.1 Namespaces and Multiple Files</a></li>
<li><a href="#orgfb83e7d">4.2 Limitations of Namespaces</a></li>
<li><a href="#org2538f21">4.3 Load Modules</a></li>
</ul>
</li>
<li><a href="#orga1b278d">5 Generics</a>
<ul>
<li><a href="#org3bb879c">5.1 Module Exercise</a></li>
</ul>
</li>
<li><a href="#orgbc99394">6 Use JavaScript Libraries with TypeScript</a>
<ul>
<li><a href="#org52a1e97">6.1 Use jQuery</a></li>
<li><a href="#org76e878a">6.2 Understand Declaration Files</a></li>
<li><a href="#orgda3cfc4">6.3 Use Public Type Definitions</a></li>
</ul>
</li>
<li><a href="#org883f75b">7 TypeScript Workflows</a>
<ul>
<li><a href="#orgcac7de3">7.1 Add TypeScript to Gulp Workflow</a></li>
<li><a href="#orge04c283">7.2 Add TypeScript to Webpack Workflow</a></li>
</ul>
</li>
<li><a href="#org5332d7b">8 Use TypeScript with ReactJS</a>
<ul>
<li><a href="#org9c77bbb">8.1 Project Setup</a></li>
<li><a href="#orgf0419a9">8.2 User PropTypes</a></li>
<li><a href="#org9c5a55b">8.3 Type and Class Components</a></li>
<li><a href="#orgf624e96">8.4 Wrap Up</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfc0106" class="outline-2">
<h2 id="orgcfc0106"><span class="section-number-2">1</span> Get Started</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org95de0d9" class="outline-3">
<h3 id="org95de0d9"><span class="section-number-3">1.1</span> Install TypeScript</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">npm install -g typescript
</pre>
</div>
</div>
</div>

<div id="outline-container-org451040b" class="outline-3">
<h3 id="org451040b"><span class="section-number-3">1.2</span> Use TypeScript</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Create a simple TypeScript script:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span><code>script.ts</code></label><pre class="src src-typescript"><span class="org-keyword">class</span> <span class="org-type">Greeter</span> {
  greeting: <span class="org-keyword">string</span>;
  <span class="org-keyword">constructor</span>(message: <span class="org-keyword">string</span>) {
    <span class="org-keyword">this</span>.greeting = message;
  }
  greet() {
    <span class="org-keyword">return</span> <span class="org-string">"Hello, "</span> + <span class="org-keyword">this</span>.greeting;
  }
}

<span class="org-keyword">let</span> <span class="org-variable-name">greeter</span> = <span class="org-keyword">new</span> <span class="org-type">Greeter</span>(<span class="org-string">"world"</span>);

<span class="org-keyword">let</span> <span class="org-variable-name">button</span> = document.createElement(<span class="org-string">"button"</span>);
button.textContent = <span class="org-string">"Say Hello"</span>;
button.onclick = <span class="org-keyword">function</span>() {
  alert(greeter.greet());
};

document.body.appendChild(button);
</pre>
</div>

<p>
Compile it to JavaScript:
</p>

<div class="org-src-container">
<pre class="src src-sh">tsc script.ts
<span class="org-comment-delimiter"># </span><span class="org-comment">Generates script.js</span>
</pre>
</div>

<p>
Embed the JavaScript file to an HTML document and see the effect.
</p>
</div>
</div>

<div id="outline-container-org72fdad9" class="outline-3">
<h3 id="org72fdad9"><span class="section-number-3">1.3</span> Set Up the Course Workspace</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://www.npmjs.com/package/lite-server">npm | lite-server</a></li>
</ul>

<p>
lite-server is a local dev server which loads latest files automatically. Install lite-server:
</p>

<div class="org-src-container">
<pre class="src src-sh">npm init
npm install --save-dev lite-server
</pre>
</div>

<p>
Add an npm command to start lite-server:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span><code>package.json</code></label><pre class="src src-js">{
  <span class="org-string">"scripts"</span>: {
    <span class="org-string">"start"</span>: <span class="org-string">"lite-server"</span>
  }
}
</pre>
</div>

<p>
Create a simple <code>index.html</code> and start lite-server, which will open <a href="http://localhost:3000/">http://localhost:3000/</a> in browser.
</p>

<hr />

<p>
Initialize the directory as TypeScript project: 
</p>

<div class="org-src-container">
<pre class="src src-sh">tsc --init
<span class="org-comment-delimiter"># </span><span class="org-comment">Generates tsconfig.json</span>
</pre>
</div>

<p>
Then command <code>tsc</code> will compile all TypeScript files in the directory, file names are not needed anymore.
</p>
</div>
</div>

<div id="outline-container-orgba22866" class="outline-3">
<h3 id="orgba22866"><span class="section-number-3">1.4</span> Understand the Created JavaScript Code</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Once TypeScript is compiled into JavaScript, all the type notations are removed, the result code doesn't have type constraints. TypeScript only prevents type errors during the compiling process.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb66ae3" class="outline-2">
<h2 id="orgfb66ae3"><span class="section-number-2">2</span> Using Types For A Better Code</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org2231019" class="outline-3">
<h3 id="org2231019"><span class="section-number-3">2.1</span> Module Exercise</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Add types as explicitly as possible to this code:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span class="org-keyword">let</span> <span class="org-variable-name">bankAccount</span> = {
    money: 2000,
    deposit(value) {
        <span class="org-keyword">this</span>.money += value;
    }
};

<span class="org-keyword">let</span> <span class="org-variable-name">myself</span> = {
    name: <span class="org-string">"Max"</span>,
    bankAccount: bankAccount,
    hobbies: [<span class="org-string">"Sports"</span>, <span class="org-string">"Cooking"</span>]
};

myself.bankAccount.deposit(3000);
</pre>
</div>

<p>
Result:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span class="org-keyword">type</span> <span class="org-type">BankAccount</span> = {
    money: <span class="org-keyword">number</span>,
    deposit: (value: <span class="org-keyword">number</span>) =&gt; <span class="org-keyword">void</span>
};

<span class="org-keyword">type</span> <span class="org-type">User</span> = {
    name: <span class="org-keyword">string</span>,
    bankAccount: BankAccount,
    hobbies: <span class="org-keyword">string</span>[]
};

<span class="org-keyword">let</span> <span class="org-variable-name">account</span>: BankAccount = {
    money: 2000,
    deposit(value: <span class="org-keyword">number</span>): <span class="org-keyword">void</span> {
        <span class="org-keyword">this</span>.money += value;
    }
};

<span class="org-keyword">let</span> <span class="org-variable-name">me</span>: User = {
    name: <span class="org-string">"Max"</span>,
    bankAccount: account,
    hobbies: [<span class="org-string">"Sports"</span>, <span class="org-string">"Cooking"</span>]
};

me.bankAccount.deposit(3000);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9424572" class="outline-2">
<h2 id="org9424572"><span class="section-number-2">3</span> TypeScript and ES6</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org75da616" class="outline-3">
<h3 id="org75da616"><span class="section-number-3">3.1</span> The Spread and Rest Operators</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax">MDN | JavaScript | Reference | Expressions &amp; Operators | Spread Syntax</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/rest_parameters">MDN | JavaScript | Reference | Functions | Rest Parameters</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-typescript"><span class="org-keyword">const</span> <span class="org-variable-name">foo</span> = (...args: <span class="org-keyword">string</span>[]) =&gt; { <span class="org-comment-delimiter">// </span><span class="org-comment">Rest</span>
  console.log(args);
}
<span class="org-keyword">let</span> <span class="org-variable-name">bar</span>: <span class="org-keyword">string</span>[] = [<span class="org-string">"b"</span>, <span class="org-string">"a"</span>, <span class="org-string">"r"</span>];
foo(...bar); <span class="org-comment-delimiter">// </span><span class="org-comment">Spread</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc85f9b4" class="outline-2">
<h2 id="orgc85f9b4"><span class="section-number-2">4</span> Namespaces and Modules</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org46c525f" class="outline-3">
<h3 id="org46c525f"><span class="section-number-3">4.1</span> Namespaces and Multiple Files</h3>
<div class="outline-text-3" id="text-4-1">
<p>
When a namespace spreads across multiple files:
</p>

<ul class="org-ul">
<li>Compile the files individually and include all the <code>.js</code> files in HTML.</li>
<li>Compile the files into a single file by <code>tsc --outFile app.js foo.ts bar.ts ...</code>.</li>
<li>Use <code>/// &lt;reference/&gt;</code> notation to declare the dependencies among the files, and compile the entry file. Compiler will automatically include the referenced files.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb83e7d" class="outline-3">
<h3 id="orgfb83e7d"><span class="section-number-3">4.2</span> Limitations of Namespaces</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When the application grow, dependencies become less maintainable by using namespaces which needs the <code>/// &lt;reference/&gt;</code> notation. Modules should be used in this scenario. 
</p>
</div>
</div>
