programming/course/understanding_typescript.org
** Load Modules

[[https://rollupjs.org/guide/en/][rollup.js]]

The config file specifies the module standard to be used by the compiler:

#+CAPTION: =tsconfig.json=
#+BEGIN_SRC js
{
  "compilerOptions": {
    "module": "commonjs"
  }
}
#+END_SRC

Regardless of the module standard, module importing won't work directly in browser. A module loader such as rollup.js needs to be used.

-----

Module usage example:

#+CAPTION: =/foo/bar.ts=
#+BEGIN_SRC typescript
export const name = 'bar';
export const bar = () => 'This is bar.';
#+END_SRC

#+CAPTION: =/app.ts=
#+BEGIN_SRC typescript
import { name, bar } from './foo/bar';
console.log(name);
console.log(bar());
#+END_SRC

-----

Install rollup.js:

#+BEGIN_SRC sh
$ npm install --save-dev rollup
#+END_SRC

Update compiler config to use ES2015 module standard:

#+CAPTION: =tsconfig.json=
#+BEGIN_SRC js
{
  "compilerOptions": {
    "module": "es2015"
  }
}
#+END_SRC

Add an npm script to invoke rollup.js after compiling TypeScript:

#+CAPTION: =package.json=
#+BEGIN_SRC js
{
  "scripts": {
    "build": "tsc && rollup app.js --format iife --file app.js"
  }
}
#+END_SRC

Then to compile TypeScript:

#+BEGIN_SRC sh
$ npm run build
#+END_SRC
* Generics
** Module Exercise

Write a class that implements a generic map, which stores the given type of elements keyed by strings.

#+BEGIN_SRC typescript
class MyMap<T> {
  private map: { [key: string]: T } = {};
  setItem(key: string, value: T) {
    this.map[key] = value;
  }
  getItem(key: string) {
    return this.map[key];
  }
  clear() {
    this.map = {};
  }
  print() {
    for (let key in this.map) {
      console.log(key + ':' + this.map[key]);
    }
  }
}

let map = new MyMap<number>();
map.setItem('foo', 1);
map.setItem('bar', 2);
console.log(map.getItem('foo'));
map.print();
map.clear();
#+END_SRC

* Use JavaScript Libraries with TypeScript
** Use jQuery

Include a jQuery distribution file into HTML to make it available for the page. However it can't be used directly in TypeScript code, because =$= is not defined. One way to define it and get past compiling:

#+BEGIN_SRC typescript
declare var $: any;
$('...'); // OK
#+END_SRC

** Understand Declaration Files

TypeScript compiler loads automatically declaration files with =.d.ts= extensions. Declaration files are similar to header files, where global variables and functions can be defined and shared among all TypeScript files.

#+CAPTION: =jquery.d.ts=
#+BEGIN_SRC typescript
declare var $: any;
#+END_SRC

** Use Public Type Definitions

- [[http://definitelytyped.org/][DefinitelyTyped]]
- [[https://github.com/DefinitelyTyped/DefinitelyTyped/tree/master/types/jquery][DefinitelyTyped | jQuery]]

To install type definitions provided by DefinitelyTyped for jQuery:

#+BEGIN_SRC sh
$ npm init
$ npm install --save-dev @types/jquery
#+END_SRC

TypeScript compiler will automatically pick up the type definitions under =node_modules/@types/jquery/=. The type definitions also enable IDE to provide type checks and auto completions.

* TypeScript Workflows
** Add TypeScript to Gulp Workflow

- [[https://gulpjs.com/][gulp.js]]
- [[https://www.npmjs.com/package/gulp-typescript][npm | gulp-typescript]]

gulp.js is a build system. gulp-typescript is a plugin which wraps the TypeScript compiler via API.

Install packages:

#+BEGIN_SRC sh
$ npm install --save-dev gulp gulp-typescript typescript
#+END_SRC

Create gulp config file:

#+CAPTION: =gulpfile.js=
#+BEGIN_SRC js
var gulp = require('gulp');
var ts = require('gulp-typescript');

var tsProject = ts.createProject('tsconfig.json'); // Load compiler config

gulp.task('typescript', function() {
  return tsProject.src()      // Take all source files of the project
    .pipe(tsProject())        // Compile with the loaded config
    .pipe(gulp.dest('dist')); // Put the result somewhere
});

gulp.task('watch', function() {
  gulp.watch('*.ts', gulp.series('typescript')); // Watch for *.ts files and run
                                                 // the "typescript" task
});

gulp.task('default', gulp.series('watch')); // Run "watch" task by default
#+END_SRC

Add an npm script to run gulp:

#+CAPTION: =package.json=
#+BEGIN_SRC js
{
  "scripts": {
    "build": "gulp"
  }
}
#+END_SRC

