programming/course/understanding_typescript.html

<div id="outline-container-org2538f21" class="outline-3">
<h3 id="org2538f21"><span class="section-number-3">4.3</span> Load Modules</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<a href="https://rollupjs.org/guide/en/">rollup.js</a>
</p>

<p>
The config file specifies the module standard to be used by the compiler:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span><code>tsconfig.json</code></label><pre class="src src-js">{
  <span class="org-string">"compilerOptions"</span>: {
    <span class="org-string">"module"</span>: <span class="org-string">"commonjs"</span>
  }
}
</pre>
</div>

<p>
Regardless of the module standard, module importing won't work directly in browser. A module loader such as rollup.js needs to be used.
</p>

<hr />

<p>
Module usage example:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span><code>/foo/bar.ts</code></label><pre class="src src-typescript"><span class="org-keyword">export</span> <span class="org-keyword">const</span> <span class="org-variable-name">name</span> = <span class="org-string">'bar'</span>;
<span class="org-keyword">export</span> <span class="org-keyword">const</span> <span class="org-variable-name">bar</span> = () =&gt; <span class="org-string">'This is bar.'</span>;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span><code>/app.ts</code></label><pre class="src src-typescript"><span class="org-keyword">import</span> { name, bar } <span class="org-keyword">from</span> <span class="org-string">'./foo/bar'</span>;
console.log(name);
console.log(bar());
</pre>
</div>

<hr />

<p>
Install rollup.js:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ npm install --save-dev rollup
</pre>
</div>

<p>
Update compiler config to use ES2015 module standard:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span><code>tsconfig.json</code></label><pre class="src src-js">{
  <span class="org-string">"compilerOptions"</span>: {
    <span class="org-string">"module"</span>: <span class="org-string">"es2015"</span>
  }
}
</pre>
</div>

<p>
Add an npm script to invoke rollup.js after compiling TypeScript:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span><code>package.json</code></label><pre class="src src-js">{
  <span class="org-string">"scripts"</span>: {
    <span class="org-string">"build"</span>: <span class="org-string">"tsc &amp;&amp; rollup app.js --format iife --file app.js"</span>
  }
}
</pre>
</div>

<p>
Then to compile TypeScript:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ npm run build
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga1b278d" class="outline-2">
<h2 id="orga1b278d"><span class="section-number-2">5</span> Generics</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org3bb879c" class="outline-3">
<h3 id="org3bb879c"><span class="section-number-3">5.1</span> Module Exercise</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Write a class that implements a generic map, which stores the given type of elements keyed by strings.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span class="org-keyword">class</span> <span class="org-type">MyMap</span>&lt;T&gt; {
  <span class="org-keyword">private</span> map: { [key: <span class="org-keyword">string</span>]: T } = {};
  setItem(key: <span class="org-keyword">string</span>, value: T) {
    <span class="org-keyword">this</span>.map[key] = value;
  }
  getItem(key: <span class="org-keyword">string</span>) {
    <span class="org-keyword">return</span> <span class="org-keyword">this</span>.map[key];
  }
  clear() {
    <span class="org-keyword">this</span>.map = {};
  }
  print() {
    <span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">key</span> <span class="org-keyword">in</span> <span class="org-keyword">this</span>.map) {
      console.log(key + <span class="org-string">':'</span> + <span class="org-keyword">this</span>.map[key]);
    }
  }
}

<span class="org-keyword">let</span> <span class="org-variable-name">map</span> = <span class="org-keyword">new</span> <span class="org-type">MyMap</span>&lt;<span class="org-keyword">number</span>&gt;();
map.setItem(<span class="org-string">'foo'</span>, 1);
map.setItem(<span class="org-string">'bar'</span>, 2);
console.log(map.getItem(<span class="org-string">'foo'</span>));
map.print();
map.clear();
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc99394" class="outline-2">
<h2 id="orgbc99394"><span class="section-number-2">6</span> Use JavaScript Libraries with TypeScript</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org52a1e97" class="outline-3">
<h3 id="org52a1e97"><span class="section-number-3">6.1</span> Use jQuery</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Include a jQuery distribution file into HTML to make it available for the page. However it can't be used directly in TypeScript code, because <code>$</code> is not defined. One way to define it and get past compiling:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span class="org-keyword">declare</span> <span class="org-keyword">var</span> <span class="org-variable-name">$</span>: <span class="org-keyword">any</span>;
$(<span class="org-string">'...'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org76e878a" class="outline-3">
<h3 id="org76e878a"><span class="section-number-3">6.2</span> Understand Declaration Files</h3>
<div class="outline-text-3" id="text-6-2">
<p>
TypeScript compiler loads automatically declaration files with <code>.d.ts</code> extensions. Declaration files are similar to header files, where global variables and functions can be defined and shared among all TypeScript files.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span><code>jquery.d.ts</code></label><pre class="src src-typescript"><span class="org-keyword">declare</span> <span class="org-keyword">var</span> <span class="org-variable-name">$</span>: <span class="org-keyword">any</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda3cfc4" class="outline-3">
<h3 id="orgda3cfc4"><span class="section-number-3">6.3</span> Use Public Type Definitions</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li><a href="http://definitelytyped.org/">DefinitelyTyped</a></li>
<li><a href="https://github.com/DefinitelyTyped/DefinitelyTyped/tree/master/types/jquery">DefinitelyTyped | jQuery</a></li>
</ul>

<p>
To install type definitions provided by DefinitelyTyped for jQuery:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ npm init
$ npm install --save-dev @types/jquery
</pre>
</div>

<p>
TypeScript compiler will automatically pick up the type definitions under <code>node_modules/@types/jquery/</code>. The type definitions also enable IDE to provide type checks and auto completions.
</p>
</div>
</div>
</div>

<div id="outline-container-org883f75b" class="outline-2">
<h2 id="org883f75b"><span class="section-number-2">7</span> TypeScript Workflows</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgcac7de3" class="outline-3">
<h3 id="orgcac7de3"><span class="section-number-3">7.1</span> Add TypeScript to Gulp Workflow</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><a href="https://gulpjs.com/">gulp.js</a></li>
<li><a href="https://www.npmjs.com/package/gulp-typescript">npm | gulp-typescript</a></li>
</ul>

<p>
gulp.js is a build system. gulp-typescript is a plugin which wraps the TypeScript compiler via API.
</p>

<p>
Install packages:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ npm install --save-dev gulp gulp-typescript typescript
</pre>
</div>

<p>
Create gulp config file:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span><code>gulpfile.js</code></label><pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">gulp</span> = require(<span class="org-string">'gulp'</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">ts</span> = require(<span class="org-string">'gulp-typescript'</span>);

<span class="org-keyword">var</span> <span class="org-variable-name">tsProject</span> = ts.createProject(<span class="org-string">'tsconfig.json'</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Load compiler config</span>

gulp.task(<span class="org-string">'typescript'</span>, <span class="org-keyword">function</span>() {
  <span class="org-keyword">return</span> tsProject.src()      <span class="org-comment-delimiter">// </span><span class="org-comment">Take all source files of the project</span>
    .pipe(tsProject())        <span class="org-comment-delimiter">// </span><span class="org-comment">Compile with the loaded config</span>
    .pipe(gulp.dest(<span class="org-string">'dist'</span>)); <span class="org-comment-delimiter">// </span><span class="org-comment">Put the result somewhere</span>
});

gulp.task(<span class="org-string">'watch'</span>, <span class="org-keyword">function</span>() {
  gulp.watch(<span class="org-string">'*.ts'</span>, gulp.series(<span class="org-string">'typescript'</span>)); <span class="org-comment-delimiter">// </span><span class="org-comment">Watch for *.ts files and run</span>
                                                 <span class="org-comment-delimiter">// </span><span class="org-comment">the "typescript" task</span>
});

gulp.task(<span class="org-string">'default'</span>, gulp.series(<span class="org-string">'watch'</span>)); <span class="org-comment-delimiter">// </span><span class="org-comment">Run "watch" task by default</span>
</pre>
</div>

<p>
Add an npm script to run gulp:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span><code>package.json</code></label><pre class="src src-js">{
  <span class="org-string">"scripts"</span>: {
    <span class="org-string">"build"</span>: <span class="org-string">"gulp"</span>
  }
}
</pre>
</div>
</div>
</div>
